# WoodSpecies Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..WoodSpecies Property
StructuralAsset Class See Also
---
The species of wood used in a wood-based asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string WoodSpecies { get; set; }
```

Visual Basic
---
```text
Public Property WoodSpecies As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ WoodSpecies {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
Applies to wood-based structural assets.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | When setting this property: the material type must be wood to set this property. |

# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace